08_OtherMarineTutorials/interFoam_OpenFoam-dev/floatingObject/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject -noFields
runApplication setFields

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructParMesh
runApplication reconstructPar

#------------------------------------------------------------------------------
